package ru.top.homework19;
//ѕользователь с клавиатуры вводит путь к существующей директории и слово дл€ поиска. ѕосле чего запускаютс€
//два потока. ѕервый должен найти файлы, содержащие
//искомое слово и слить их содержимое в один файл. ¬торой
//поток ожидает завершени€ работы первого потока. ѕосле
//чего проводит вырезание всех запрещенных слов(список
//этих слов нужно считать из файла с запрещенными словами) из полученного файла.


public class Main {
    public static void main(String[] args) {

    }
}
